# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [43]:
import pandas as pd
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [44]:
s1 = pd.Series(np.random.randint(1,5,100))
s2 = pd.Series(np.random.randint(1,4,100))
s3 = pd.Series(np.random.randint(10000,30001,100))

### Step 3. Let's create a DataFrame by joinning the Series by column

In [45]:
df = pd.concat([s1,s2,s3],axis = 1)

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [46]:
df.columns = ['bedrs', 'bathrs', 'price_sqr_meter']
df

    bedrs  bathrs  price_sqr_meter
0       1       1            22680
1       2       1            24206
2       2       3            25482
3       3       3            29890
4       2       2            20240
..    ...     ...              ...
95      4       2            27265
96      3       1            24842
97      1       1            28140
98      1       3            26150
99      2       1            15245

[100 rows x 3 columns]

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [47]:
df= pd.DataFrame(pd.concat([s1,s2,s3]))
df

        0
0       1
1       2
2       2
3       3
4       2
..    ...
95  27265
96  24842
97  28140
98  26150
99  15245

[300 rows x 1 columns]

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [48]:
df.index

Int64Index([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9,
            ...
            90, 91, 92, 93, 94, 95, 96, 97, 98, 99],
           dtype='int64', length=300)

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [49]:
df.reset_index(inplace = True,drop = True)
df

         0
0        1
1        2
2        2
3        3
4        2
..     ...
295  27265
296  24842
297  28140
298  26150
299  15245

[300 rows x 1 columns]